# 1  Напишите программу, удаляющую из текста все слова, содержащие "абв".

text="абв абввба вбаабввба абв"
print(text.replace('абв',''))